bouffalolab/bouffalo_sdk/drivers/bl702_driver/hal_drv/src/hal_pm.c
void HBN_OUT1_IRQ(void)
{
    /* PIR */
    if (SET == HBN_Get_INT_State(HBN_INT_PIR)) {
        HBN_Clear_IRQ(HBN_INT_PIR);
    }

    /* BOR */
    if (SET == HBN_Get_INT_State(HBN_INT_BOR)) {
        HBN_Clear_IRQ(HBN_INT_BOR);
    }

    /* ACOMP0 */
    if (SET == HBN_Get_INT_State(HBN_INT_ACOMP0)) {
        HBN_Clear_IRQ(HBN_INT_ACOMP0);
        pm_irq_callback(PM_HBN_ACOMP0_WAKEUP_EVENT);
    }

    /* ACOMP1 */
    if (SET == HBN_Get_INT_State(HBN_INT_ACOMP1)) {
        HBN_Clear_IRQ(HBN_INT_ACOMP1);
        pm_irq_callback(PM_HBN_ACOMP1_WAKEUP_EVENT);
    }
}

__WEAK void pm_irq_callback(enum pm_event_type event)
{
}
/**
 * @brief hal_pds_enter_with_time_compensation
 *
 * @param pdsLevel pds level support 0~3,31
 * @param pdsSleepCycles if user set sleep time, pdsSleepCycles cannot be less than 32768, pdsSleepCycles is a multiple of 32768 preferably.
 * @return uint32_t actual sleep time(ms)
 *
 * @note If necessary，please application layer call vTaskStepTick，
 */
uint32_t hal_pds_enter_with_time_compensation(uint32_t pdsLevel, uint32_t pdsSleepCycles)
{
    uint32_t rtcLowBeforeSleep = 0, rtcHighBeforeSleep = 0;
    uint32_t rtcLowAfterSleep = 0, rtcHighAfterSleep = 0;
    uint32_t actualSleepDuration_32768cycles = 0;
    uint32_t actualSleepDuration_ms = 0;

    HBN_Get_RTC_Timer_Val(&rtcLowBeforeSleep, &rtcHighBeforeSleep);

    pm_pds_mode_enter(pdsLevel, pdsSleepCycles / 32768);

    HBN_Get_RTC_Timer_Val(&rtcLowAfterSleep, &rtcHighAfterSleep);

    CHECK_PARAM((rtcHighAfterSleep - rtcHighBeforeSleep) <= 1); // make sure sleep less than 1 hour (2^32 us > 1 hour)

    actualSleepDuration_32768cycles = (rtcLowAfterSleep - rtcLowBeforeSleep);

    actualSleepDuration_ms = (actualSleepDuration_32768cycles >> 5) - (actualSleepDuration_32768cycles >> 11) - (actualSleepDuration_32768cycles >> 12);

    // vTaskStepTick(actualSleepDuration_ms);

    return actualSleepDuration_ms;
}
